//Конфигурация периферии и т.д.

#include "initConst.h"
#include "podgot12f683.h"
#include <pic.h>

//-----------------------------------------------------------
	
		void fnPodgot(void) {
 TRISIO=0b111001; //
 GPIO=0b000000; //
 IOC=0b00111001;//
 CMCON0=0b00000111;   //
 ADCON0=0b00000000;  //
 ANSEL=0b000000;  //
 WPU=0b100001;  //подтягивающие резисторы
 INTCON=0b11000000;  //   настройка прерываний
 PIE1=0b00000001;  //   настрйка прерываний
 OPTION=0b00000111;  //
 
 T1CON=0b00000001;  // prescaler 1:1() ?????
 T2CON=0b00000100; //prescaler 1:1
 
 TMR1H =0b11111011;//загрузка значений в старший регистр TMR1 .загружаем в TMR1  64285  ,чтобы получить прерывания каждую 1 мс(при 4 MHz и делителе 1:1  64535)
 TMR1L =0b00011101;//загрузка значений в младший регистр TMR1
 
 CCP1CON = 0b00001100;//
 PR2 = 0xff;          //период ШИМ (7.6kHz) ,10bit . 
 //****скважность ШИМ*********
 CCPR1L=0b00000000;  // ????????
 
//*************************** 
 OSCCON = 0b01110000;      //настройка внутреннего генератора 8MHz.
 	}	
//-------------------------------------------------------- 