/*блок ШИМ1.Передаем значение скважности (n).*/


#include "pwm1.h"
#include <pic.h>

//-------------------------------------------------------------------------------

void fnPwm1 (unsigned int n);

//----------------------------------------------------------------------------
void fnPwm1 (unsigned int n ){
	

    CCP1CON &= ~(1<<4);         
    if ((n) & 1)              
        CCP1CON |= 1<<4;        
    CCP1CON &= ~(1<<5);         
    if ((n) & 2)              
        CCP1CON |= 1<<5;       
    CCPR1L=((n)>>2);          

CCPR1L=((n)>>2); 
}

